'use strict';


function task1() {

	let a = 1, b = 1, c, d;

	c = ++a;

	// оператор инкремента стоит перед а => сначала число увеличится на 1 а затем присвоится с
	// ответ: 2

	alert("c = " + c);

	d = b++;

	// оператор инкремента стоит после b => сначала происходит присвоение значения для d а затем увеличение b на 1
	// ответ: 1

	alert("d = " + d); 

	c = 2 + ++a;

	// оператор инкремента перед а => сначала происходит увеличение а на 1 а затем сложение с 2 и присвоение с
	// выше а уже увеличивалось на 1 значит после этой операции станет равна 3
	// 2 + 3 = 5
	// ответ : 5 
	alert("c = " + c);

	d = 2 + b++;

	// оператор инкремента стоит после b => сначала произойдет сложение и присвоение а затем увеличение b на 1
	// 2 + 2 = 4
	// ответ: 4
	alert("d = " + d);

	alert("a = " + a); // после двух икрементов значение стало 3
	alert("b = " + b); // после двух икрементов значение стало 3
}




