'use strict'

function task3() {
	alert("Вывод в консоли. Комментарии в task3.js");

	let result = 10 + 10 + "10";
	console.log(result);
	/*
	1. Сложение 10 + 10 = 20
	2. Конкатинация 20 и 10. 20 превращается в строку.
	Итог: 2010
	*/
	result = "10" + 10 + "10";
	console.log(result);
	/*
	1. Конкатинация "10" и 10. Число 10 превращается в строку. => 1010
	2. Конкатинация строк 1010 и 10 = 101010
	Итог: 101010
	*/
	result = 10 + 10 + +"10";
	console.log(result);
	/*
	1. Сложение 10 и 10 = 20
	2. +"10" - унарные оператор => Конвертирование в число 10
	3. 20 + 10 = 30
	Итог: 30
	*/
	result = 10/-"";
	console.log(result);
	/*
	1. -"" - унарный оператор => -"" = -0
	2. 10/ -0 = -Infinity
	Итог: -Infinity
	*/
	result = 10 / +"2,5";
	console.log(result);
	/*
	1. +"2,5" - унарный оператор, но запятая не является разделителем => это не число => NaN
	2. 10 / NaN = NaN
	Итог: NaN
	*/

}